midwares/nginx.org
#+TITLE:     Nginx
#+AUTHOR:    Hao Ruan
#+EMAIL:     ruanhao1116@gmail.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS: h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>
#+TOC: headlines 3


* 基本原理

** 设计架构

Nginx 会同时运行多个进程，一个主进程（master）和多个工作进程（worker），配置缓存时还会有缓存加载器进程（cache loader）和
缓存管理器进程（cache manager）等。所有进程均仅含一个线程，通过共享内存的机制实现进程间通信。主进程以 root 身份运行，
其余进程以非特权身份运行。

*** master 进程

- 读取并验证配置信息
- 创建，绑定及关闭套接字
- 启动，终止及维护 worker 进程的个数
- 配置热部署（平滑升级）
- 编译嵌入式脚本
- 日志文件管理


*** worker 进程

- 接受并处理客户端连接
- 提供反向代理及过滤功能


*** cache loader 进程

- 建立内存数据库


*** cache manager 进程

- 缓存失效及过期检查


* 常用配置

** 基本配置

#+BEGIN_SRC nginx
  server {

      listen 40839;
      root /var/data;             # 网站的源代码静态文件的根目录。
      server_name example.org;    # 域名

      location / {
          index index.html index.php;
          # 当访问 http://example.org 时就会去读取 /var/root/index.html ，
          # 如果找不到就会读取 index.php ，就会转发到 fastcgi_pass 里面的逻辑
      }

      location ~* \.(gif|jpg|png)$ {
          expires 30d;            # 在 30 天后过期，也就是缓存 30 天
      }

      location ~ \.php$ {
          fastcgi_pass  localhost:9000;
          fastcgi_param SCRIPT_FILENAME
                        $document_root$fastcgi_script_name;
          include       fastcgi_params;
      }

  }
#+END_SRC


** 反向代理

反向代理是依赖于 `ngx_http_proxy_module` 这个模块来实现的


*** 直接转发

#+BEGIN_SRC nginx
  server {
      server_name www.example.com;
      listen       443;

      location /reverse.gif {
          proxy_pass http://image.sinajs.cn/newchart/hollow/small/nsh000001.gif;
      }

  }
#+END_SRC


*** 动态转发

#+BEGIN_SRC nginx
  upstream pool {
      server 127.0.0.1:8888;
  }

  server {

      listen 40839;
      root /tmp/data;
      server_name example.org;

      try_files $uri/index.html @reverse; # 先找根目录下的 index.html ，如果找不到，才执行 location @rails365

      location @reverse {
          proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
          proxy_set_header Host $http_host;
          proxy_redirect off;
          proxy_pass http://pool;
      }
  }
#+END_SRC


*** websocket 转发

#+BEGIN_SRC nginx
  upstream ws {
    server http://127.0.0.1:8888;
  }

  server {

    location /ws/ {
      proxy_pass ws;
      proxy_http_version 1.1;

      proxy_read_timeout    7200;
      proxy_send_timeout    7200;

      proxy_set_header Upgrade $http_upgrade;
      proxy_set_header Connection "upgrade";
    }

  }

#+END_SRC


