midwares/nginx.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-05-23 Wed 17:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nginx</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Nginx</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc807b59">1. 基本原理</a>
<ul>
<li><a href="#org85b73bd">1.1. 设计架构</a>
<ul>
<li><a href="#org998fd71">1.1.1. master 进程</a></li>
<li><a href="#org6a27c79">1.1.2. worker 进程</a></li>
<li><a href="#org6000195">1.1.3. cache loader 进程</a></li>
<li><a href="#org7691b74">1.1.4. cache manager 进程</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgba9c65e">2. 常用配置</a>
<ul>
<li><a href="#org226092d">2.1. 基本配置</a></li>
<li><a href="#orgc9eceb5">2.2. 反向代理</a>
<ul>
<li><a href="#org9d868b5">2.2.1. 直接转发</a></li>
<li><a href="#org93e3e11">2.2.2. 动态转发</a></li>
<li><a href="#org6940896">2.2.3. websocket 转发</a></li>
</ul>
</li>
<li><a href="#org04f0c25">2.3. 压缩</a></li>
<li><a href="#org051b3df">2.4. 监控</a></li>
<li><a href="#org83786ba">2.5. Basic Auth</a></li>
<li><a href="#orgb58dddf">2.6. 负载均衡</a>
<ul>
<li><a href="#orgee49219">2.6.1. least_conn</a></li>
<li><a href="#org029df12">2.6.2. ip_hash</a></li>
<li><a href="#org1f6a76f">2.6.3. hash</a></li>
<li><a href="#org6a6e264">2.6.4. down</a></li>
<li><a href="#org230a9d3">2.6.5. backup</a></li>
<li><a href="#orgf6f9b17">2.6.6. weight</a></li>
</ul>
</li>
<li><a href="#org65d6944">2.7. 返回状态码</a></li>
<li><a href="#orgb90452f">2.8. URL 重写</a></li>
<li><a href="#org2050f1c">2.9. Location</a>
<ul>
<li><a href="#orge7f0a36">2.9.1. 优先级</a></li>
<li><a href="#org87471a3">2.9.2. 转发规则</a></li>
</ul>
</li>
<li><a href="#org954a7be">2.10. 访问控制</a></li>
<li><a href="#org58e835a">2.11. 端口转发</a></li>
<li><a href="#orgaa90fe0">2.12. 添加模块</a></li>
<li><a href="#orgfaed7f1">2.13. Nginx in Docker</a>
<ul>
<li><a href="#orge5e556f">2.13.1. 获取 nginx.conf</a></li>
<li><a href="#orgc274810">2.13.2. 自定义 nginx.conf</a></li>
<li><a href="#org3fe4ed2">2.13.3. 自定义静态文件</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (ruanhao1116@gmail.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-05-23 17:58:47</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc807b59">1. 基本原理</a>
<ul>
<li><a href="#org85b73bd">1.1. 设计架构</a>
<ul>
<li><a href="#org998fd71">1.1.1. master 进程</a></li>
<li><a href="#org6a27c79">1.1.2. worker 进程</a></li>
<li><a href="#org6000195">1.1.3. cache loader 进程</a></li>
<li><a href="#org7691b74">1.1.4. cache manager 进程</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgba9c65e">2. 常用配置</a>
<ul>
<li><a href="#org226092d">2.1. 基本配置</a></li>
<li><a href="#orgc9eceb5">2.2. 反向代理</a>
<ul>
<li><a href="#org9d868b5">2.2.1. 直接转发</a></li>
<li><a href="#org93e3e11">2.2.2. 动态转发</a></li>
<li><a href="#org6940896">2.2.3. websocket 转发</a></li>
</ul>
</li>
<li><a href="#org04f0c25">2.3. 压缩</a></li>
<li><a href="#org051b3df">2.4. 监控</a></li>
<li><a href="#org83786ba">2.5. Basic Auth</a></li>
<li><a href="#orgb58dddf">2.6. 负载均衡</a>
<ul>
<li><a href="#orgee49219">2.6.1. least_conn</a></li>
<li><a href="#org029df12">2.6.2. ip_hash</a></li>
<li><a href="#org1f6a76f">2.6.3. hash</a></li>
<li><a href="#org6a6e264">2.6.4. down</a></li>
<li><a href="#org230a9d3">2.6.5. backup</a></li>
<li><a href="#orgf6f9b17">2.6.6. weight</a></li>
</ul>
</li>
<li><a href="#org65d6944">2.7. 返回状态码</a></li>
<li><a href="#orgb90452f">2.8. URL 重写</a></li>
<li><a href="#org2050f1c">2.9. Location</a>
<ul>
<li><a href="#orge7f0a36">2.9.1. 优先级</a></li>
<li><a href="#org87471a3">2.9.2. 转发规则</a></li>
</ul>
</li>
<li><a href="#org954a7be">2.10. 访问控制</a></li>
<li><a href="#org58e835a">2.11. 端口转发</a></li>
<li><a href="#orgaa90fe0">2.12. 添加模块</a></li>
<li><a href="#orgfaed7f1">2.13. Nginx in Docker</a>
<ul>
<li><a href="#orge5e556f">2.13.1. 获取 nginx.conf</a></li>
<li><a href="#orgc274810">2.13.2. 自定义 nginx.conf</a></li>
<li><a href="#org3fe4ed2">2.13.3. 自定义静态文件</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgc807b59" class="outline-2">
<h2 id="orgc807b59"><span class="section-number-2">1</span> 基本原理</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org85b73bd" class="outline-3">
<h3 id="org85b73bd"><span class="section-number-3">1.1</span> 设计架构</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Nginx 会同时运行多个进程，一个主进程（master）和多个工作进程（worker），配置缓存时还会有缓存加载器进程（cache loader）和
缓存管理器进程（cache manager）等。所有进程均仅含一个线程，通过共享内存的机制实现进程间通信。主进程以 root 身份运行，
其余进程以非特权身份运行。
</p>
</div>

<div id="outline-container-org998fd71" class="outline-4">
<h4 id="org998fd71"><span class="section-number-4">1.1.1</span> master 进程</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>读取并验证配置信息</li>
<li>创建，绑定及关闭套接字</li>
<li>启动，终止及维护 worker 进程的个数</li>
<li>配置热部署（平滑升级）</li>
<li>编译嵌入式脚本</li>
<li>日志文件管理</li>
</ul>
</div>
</div>


<div id="outline-container-org6a27c79" class="outline-4">
<h4 id="org6a27c79"><span class="section-number-4">1.1.2</span> worker 进程</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>接受并处理客户端连接</li>
<li>提供反向代理及过滤功能</li>
</ul>
</div>
</div>


<div id="outline-container-org6000195" class="outline-4">
<h4 id="org6000195"><span class="section-number-4">1.1.3</span> cache loader 进程</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>建立内存数据库</li>
</ul>
</div>
</div>


<div id="outline-container-org7691b74" class="outline-4">
<h4 id="org7691b74"><span class="section-number-4">1.1.4</span> cache manager 进程</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>缓存失效及过期检查</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-orgba9c65e" class="outline-2">
<h2 id="orgba9c65e"><span class="section-number-2">2</span> 常用配置</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org226092d" class="outline-3">
<h3 id="org226092d"><span class="section-number-3">2.1</span> 基本配置</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">server</span> {

    <span style="color: #5f8700;">listen</span> 40839;
    <span style="color: #5f8700;">root</span> /var/data;             <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#32593;&#31449;&#30340;&#28304;&#20195;&#30721;&#38745;&#24577;&#25991;&#20214;&#30340;&#26681;&#30446;&#24405;&#12290;</span>
    <span style="color: #5f8700;">server_name</span> example.org;    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#22495;&#21517;</span>

    <span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/</span> {
        <span style="color: #5f8700;">index</span> index.html index.php;
        <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#24403;&#35775;&#38382; http://example.org &#26102;&#23601;&#20250;&#21435;&#35835;&#21462; /var/root/index.html &#65292;</span>
        <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#22914;&#26524;&#25214;&#19981;&#21040;&#23601;&#20250;&#35835;&#21462; index.php &#65292;&#23601;&#20250;&#36716;&#21457;&#21040; fastcgi_pass &#37324;&#38754;&#30340;&#36923;&#36753;</span>
    }

    <span style="color: #5f8700;">location</span> ~* <span style="color: #0087ff;">\.(gif|jpg|png)$</span> {
        <span style="color: #5f8700;">expires</span> 30d;            <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#22312; 30 &#22825;&#21518;&#36807;&#26399;&#65292;&#20063;&#23601;&#26159;&#32531;&#23384; 30 &#22825;</span>
    }

    <span style="color: #5f8700;">location</span> ~ <span style="color: #0087ff;">\.php$</span> {
        <span style="color: #5f8700;">fastcgi_pass</span>  localhost:9000;
        <span style="color: #5f8700;">fastcgi_param</span> SCRIPT_FILENAME
                      <span style="color: #0087ff;">$document_root$fastcgi_script_name</span>;
        <span style="color: #5f8700;">include</span>       fastcgi_params;
    }

}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc9eceb5" class="outline-3">
<h3 id="orgc9eceb5"><span class="section-number-3">2.2</span> 反向代理</h3>
<div class="outline-text-3" id="text-2-2">
<p>
反向代理是依赖于 `ngx_http_proxy_module` 这个模块来实现的
</p>
</div>


<div id="outline-container-org9d868b5" class="outline-4">
<h4 id="org9d868b5"><span class="section-number-4">2.2.1</span> 直接转发</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">server</span> {
    <span style="color: #5f8700;">server_name</span> www.example.com;
    <span style="color: #5f8700;">listen</span>       443;

    <span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/reverse.gif</span> {
        <span style="color: #5f8700;">proxy_pass</span> http://image.sinajs.cn/newchart/hollow/small/nsh000001.gif;
    }

}
</pre>
</div>
</div>
</div>


<div id="outline-container-org93e3e11" class="outline-4">
<h4 id="org93e3e11"><span class="section-number-4">2.2.2</span> 动态转发</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">pool</span> {
    <span style="color: #5f8700;">server</span> 127.0.0.1:8888;
}

<span style="color: #5f8700;">server</span> {

    <span style="color: #5f8700;">listen</span> 40839;
    <span style="color: #5f8700;">root</span> /tmp/data;
    <span style="color: #5f8700;">server_name</span> example.org;

    <span style="color: #5f8700;">try_files</span> <span style="color: #0087ff;">$uri</span>/index.html @reverse; <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#20808;&#25214;&#26681;&#30446;&#24405;&#19979;&#30340; index.html &#65292;&#22914;&#26524;&#25214;&#19981;&#21040;&#65292;&#25165;&#25191;&#34892; location @rails365</span>

    <span style="color: #5f8700;">location</span> <span style="color: #0087ff;">@reverse</span> {
        <span style="color: #5f8700;">proxy_set_header</span> X-Forwarded-For <span style="color: #0087ff;">$proxy_add_x_forwarded_for</span>;
        <span style="color: #5f8700;">proxy_set_header</span> Host <span style="color: #0087ff;">$http_host</span>;
        <span style="color: #5f8700;">proxy_redirect</span> <span style="color: #00afaf;">off</span>;
        <span style="color: #5f8700;">proxy_pass</span> http://pool;
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org6940896" class="outline-4">
<h4 id="org6940896"><span class="section-number-4">2.2.3</span> websocket 转发</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">ws</span> {
  <span style="color: #5f8700;">server</span> http://127.0.0.1:8888;
}

<span style="color: #5f8700;">server</span> {

  <span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/ws/</span> {
    <span style="color: #5f8700;">proxy_pass</span> ws;
    <span style="color: #5f8700;">proxy_http_version</span> 1.1;

    <span style="color: #5f8700;">proxy_read_timeout</span>    7200;
    <span style="color: #5f8700;">proxy_send_timeout</span>    7200;

    <span style="color: #5f8700;">proxy_set_header</span> Upgrade <span style="color: #0087ff;">$http_upgrade</span>;
    <span style="color: #5f8700;">proxy_set_header</span> Connection <span style="color: #00afaf;">"upgrade"</span>;
  }

}

</pre>
</div>
</div>
</div>
</div>
