midwares/nginx.org
** 压缩

#+BEGIN_SRC nginx
  http {

      # 开启gzip
      gzip on;

      # 启用gzip压缩的最小文件，小于设置值的文件将不会压缩
      gzip_min_length 1k;

      # gzip 压缩级别，1-10，数字越大压缩的越好，也越占用CPU时间，后面会有详细说明
      gzip_comp_level 2;

      # 进行压缩的文件类型。javascript有多种形式。其中的值可以在 mime.types 文件中找到。
      gzip_types text/plain application/javascript application/x-javascript text/css application/xml text/javascript application/x-httpd-php image/jpeg image/gif image/png;

      # 是否在http header中添加Vary: Accept-Encoding，建议开启
      gzip_vary on;

      # 禁用IE 6 gzip
      gzip_disable "MSIE [1-6]\.";

      server {
          location ~* ^.+\.(css|js|txt|xml|swf|wav)$ {
              access_log   off;
              expires      24h;   # 开启缓存
          }

      }
  }
#+END_SRC


** 监控

#+BEGIN_SRC sh
  pip install ngxtop
#+END_SRC


** Basic Auth

`ngx_http_auth_basic_module` 是使用文件作为存储介质的，用户名和密码必须和文件的信息匹配才能认证成功。

使用 `htpasswd` 这个命令来生成存放用户名和密码的文件，需要先安装它。

#+BEGIN_SRC sh
  htpasswd -bc /etc/nginx/.htpasswd <username> <password>
#+END_SRC

#+BEGIN_SRC nginx
  location /target {
      auth_basic "Restricted";
      auth_basic_user_file /etc/nginx/.htpasswd; # htpasswd 文件
  }
#+END_SRC


** 负载均衡

*** least_conn

优先发送给那些接受请求少的

#+BEGIN_SRC nginx
  upstream servers {
      least_conn;
      server <server_ip_1>;
      server <server_ip_2>;
  }
#+END_SRC


*** ip_hash

可以记录请求来源的ip，如果是同一个ip，下次访问的时候还是会到相同的主机

#+BEGIN_SRC nginx
  upstream servers {
      ip_hash;
      server <server_ip_1>;
      server <server_ip_2>;
  }
#+END_SRC


*** hash

通过任何变量来控制

#+BEGIN_SRC nginx
  upstream servers {
      hash $request_uri consistent; # 通过请求地址($request_uri)来控制
      server <server_ip_1>;
      server <server_ip_2>;
  }
#+END_SRC


*** down

假如有一台主机是出了故障，或者下线了，要暂时移出，那可以把它标为down，表示请求会略过这台主机

#+BEGIN_SRC nginx
  upstream servers {
      server <server_ip_1>;
      server <server_ip_2> down;
  }
#+END_SRC


*** backup

backup 是指备份的机器，相对于备份的机器来说，其他的机器就相当于主要服务器，只要当主要服务器不可用的时候，才会用到备用服务器

#+BEGIN_SRC nginx
  upstream servers {
      server <server_ip_1>;
      server <server_ip_2> backup;
  }
#+END_SRC


*** weight

weight指的是权重，默认情况下，每台主机的权重都是1，也就是说，接收请求的次数的比例是一样的。

可以根据主机的配置或其他情况自行调节，比如，对于配置高的主机，可以把weight值调大。

#+BEGIN_SRC nginx
  upstream servers {
      server <server_ip_0> weight=3;
      server <server_ip_1>;
      server <server_ip_2>;
  }
#+END_SRC


** 返回状态码

#+BEGIN_SRC nginx
  location /error {
      return 404 "Not Found !";
  }
#+END_SRC


** URL 重写

#+BEGIN_SRC nginx
  location / {
      rewrite '^/images/(.*)\.(png|jpg|gif)$' /data?file=$1.$2;
      # 注意不能在上面这条规则后面加上“last”参数，否则下面的 set 指令不会执行
      set $image_file $1;
      set $image_type $2;
  }

  location /data {
      root /tmp/data;
      # 应用前面定义的变量。判断首先文件在不在，不在再判断目录在不在，如果还不在就跳转到最
      try_files /$arg_file /404.html;
  }

  location /404.html {
      return 404 "$image_file.$image_type Not Found";
  }
#+END_SRC

#+BEGIN_SRC nginx
  location /images/ {
      rewrite ^/images/(.*)$ http://1.2.3.4/images/$1/; ## 浏览器重定向至 http://1.2.3.4/images/$1
  }
#+END_SRC


