midwares/nginx.html


<div id="outline-container-org04f0c25" class="outline-3">
<h3 id="org04f0c25"><span class="section-number-3">2.3</span> 压缩</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">http</span> {

    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#24320;&#21551;gzip</span>
    <span style="color: #5f8700;">gzip</span> <span style="color: #00afaf;">on</span>;

    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#21551;&#29992;gzip&#21387;&#32553;&#30340;&#26368;&#23567;&#25991;&#20214;&#65292;&#23567;&#20110;&#35774;&#32622;&#20540;&#30340;&#25991;&#20214;&#23558;&#19981;&#20250;&#21387;&#32553;</span>
    <span style="color: #5f8700;">gzip_min_length</span> 1k;

    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">gzip &#21387;&#32553;&#32423;&#21035;&#65292;1-10&#65292;&#25968;&#23383;&#36234;&#22823;&#21387;&#32553;&#30340;&#36234;&#22909;&#65292;&#20063;&#36234;&#21344;&#29992;CPU&#26102;&#38388;&#65292;&#21518;&#38754;&#20250;&#26377;&#35814;&#32454;&#35828;&#26126;</span>
    <span style="color: #5f8700;">gzip_comp_level</span> 2;

    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#36827;&#34892;&#21387;&#32553;&#30340;&#25991;&#20214;&#31867;&#22411;&#12290;javascript&#26377;&#22810;&#31181;&#24418;&#24335;&#12290;&#20854;&#20013;&#30340;&#20540;&#21487;&#20197;&#22312; mime.types &#25991;&#20214;&#20013;&#25214;&#21040;&#12290;</span>
    <span style="color: #5f8700;">gzip_types</span> text/plain application/javascript application/x-javascript text/css application/xml text/javascript application/x-httpd-php image/jpeg image/gif image/png;

    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#26159;&#21542;&#22312;http header&#20013;&#28155;&#21152;Vary: Accept-Encoding&#65292;&#24314;&#35758;&#24320;&#21551;</span>
    <span style="color: #5f8700;">gzip_vary</span> <span style="color: #00afaf;">on</span>;

    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#31105;&#29992;IE 6 gzip</span>
    <span style="color: #5f8700;">gzip_disable</span> <span style="color: #00afaf;">"MSIE [1-6]\."</span>;

    <span style="color: #5f8700;">server</span> {
        <span style="color: #5f8700;">location</span> ~* <span style="color: #0087ff;">^.+\.(css|js|txt|xml|swf|wav)$</span> {
            <span style="color: #5f8700;">access_log</span>   <span style="color: #00afaf;">off</span>;
            <span style="color: #5f8700;">expires</span>      24h;   <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#24320;&#21551;&#32531;&#23384;</span>
        }

    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org051b3df" class="outline-3">
<h3 id="org051b3df"><span class="section-number-3">2.4</span> 监控</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh">pip install ngxtop
</pre>
</div>
</div>
</div>


<div id="outline-container-org83786ba" class="outline-3">
<h3 id="org83786ba"><span class="section-number-3">2.5</span> Basic Auth</h3>
<div class="outline-text-3" id="text-2-5">
<p>
`ngx_http_auth_basic_module` 是使用文件作为存储介质的，用户名和密码必须和文件的信息匹配才能认证成功。
</p>

<p>
使用 `htpasswd` 这个命令来生成存放用户名和密码的文件，需要先安装它。
</p>

<div class="org-src-container">
<pre class="src src-sh">htpasswd -bc /etc/nginx/.htpasswd &lt;username&gt; &lt;password&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/target</span> {
    <span style="color: #5f8700;">auth_basic</span> <span style="color: #00afaf;">"Restricted"</span>;
    <span style="color: #5f8700;">auth_basic_user_file</span> /etc/nginx/.htpasswd; <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">htpasswd &#25991;&#20214;</span>
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb58dddf" class="outline-3">
<h3 id="orgb58dddf"><span class="section-number-3">2.6</span> 负载均衡</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgee49219" class="outline-4">
<h4 id="orgee49219"><span class="section-number-4">2.6.1</span> least_conn</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
优先发送给那些接受请求少的
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">servers</span> {
    <span style="color: #5f8700;">least_conn</span>;
    <span style="color: #5f8700;">server</span> &lt;server_ip_1&gt;;
    <span style="color: #5f8700;">server</span> &lt;server_ip_2&gt;;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org029df12" class="outline-4">
<h4 id="org029df12"><span class="section-number-4">2.6.2</span> ip_hash</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
可以记录请求来源的ip，如果是同一个ip，下次访问的时候还是会到相同的主机
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">servers</span> {
    <span style="color: #5f8700;">ip_hash</span>;
    <span style="color: #5f8700;">server</span> &lt;server_ip_1&gt;;
    <span style="color: #5f8700;">server</span> &lt;server_ip_2&gt;;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org1f6a76f" class="outline-4">
<h4 id="org1f6a76f"><span class="section-number-4">2.6.3</span> hash</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
通过任何变量来控制
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">servers</span> {
    <span style="color: #5f8700;">hash</span> <span style="color: #0087ff;">$request_uri</span> consistent; <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#36890;&#36807;&#35831;&#27714;&#22320;&#22336;($request_uri)&#26469;&#25511;&#21046;</span>
    <span style="color: #5f8700;">server</span> &lt;server_ip_1&gt;;
    <span style="color: #5f8700;">server</span> &lt;server_ip_2&gt;;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org6a6e264" class="outline-4">
<h4 id="org6a6e264"><span class="section-number-4">2.6.4</span> down</h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
假如有一台主机是出了故障，或者下线了，要暂时移出，那可以把它标为down，表示请求会略过这台主机
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">servers</span> {
    <span style="color: #5f8700;">server</span> &lt;server_ip_1&gt;;
    <span style="color: #5f8700;">server</span> &lt;server_ip_2&gt; down;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org230a9d3" class="outline-4">
<h4 id="org230a9d3"><span class="section-number-4">2.6.5</span> backup</h4>
<div class="outline-text-4" id="text-2-6-5">
<p>
backup 是指备份的机器，相对于备份的机器来说，其他的机器就相当于主要服务器，只要当主要服务器不可用的时候，才会用到备用服务器
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">servers</span> {
    <span style="color: #5f8700;">server</span> &lt;server_ip_1&gt;;
    <span style="color: #5f8700;">server</span> &lt;server_ip_2&gt; backup;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf6f9b17" class="outline-4">
<h4 id="orgf6f9b17"><span class="section-number-4">2.6.6</span> weight</h4>
<div class="outline-text-4" id="text-2-6-6">
<p>
weight指的是权重，默认情况下，每台主机的权重都是1，也就是说，接收请求的次数的比例是一样的。
</p>

<p>
可以根据主机的配置或其他情况自行调节，比如，对于配置高的主机，可以把weight值调大。
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">upstream</span> <span style="color: #0087ff;">servers</span> {
    <span style="color: #5f8700;">server</span> &lt;server_ip_0&gt; weight=3;
    <span style="color: #5f8700;">server</span> &lt;server_ip_1&gt;;
    <span style="color: #5f8700;">server</span> &lt;server_ip_2&gt;;
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org65d6944" class="outline-3">
<h3 id="org65d6944"><span class="section-number-3">2.7</span> 返回状态码</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/error</span> {
    <span style="color: #5f8700;">return</span> 404 <span style="color: #00afaf;">"Not Found !"</span>;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb90452f" class="outline-3">
<h3 id="orgb90452f"><span class="section-number-3">2.8</span> URL 重写</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/</span> {
    <span style="color: #5f8700;">rewrite</span> '^/images/(.*)\.(png|jpg|gif)$' /data?file=<span style="color: #00afaf;">$1</span>.<span style="color: #00afaf;">$2</span>;
    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#27880;&#24847;&#19981;&#33021;&#22312;&#19978;&#38754;&#36825;&#26465;&#35268;&#21017;&#21518;&#38754;&#21152;&#19978;&#8220;last&#8221;&#21442;&#25968;&#65292;&#21542;&#21017;&#19979;&#38754;&#30340; set &#25351;&#20196;&#19981;&#20250;&#25191;&#34892;</span>
    <span style="color: #5f8700;">set</span> <span style="color: #0087ff;">$image_file</span> <span style="color: #00afaf;">$1</span>;
    <span style="color: #5f8700;">set</span> <span style="color: #0087ff;">$image_type</span> <span style="color: #00afaf;">$2</span>;
}

<span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/data</span> {
    <span style="color: #5f8700;">root</span> /tmp/data;
    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#24212;&#29992;&#21069;&#38754;&#23450;&#20041;&#30340;&#21464;&#37327;&#12290;&#21028;&#26029;&#39318;&#20808;&#25991;&#20214;&#22312;&#19981;&#22312;&#65292;&#19981;&#22312;&#20877;&#21028;&#26029;&#30446;&#24405;&#22312;&#19981;&#22312;&#65292;&#22914;&#26524;&#36824;&#19981;&#22312;&#23601;&#36339;&#36716;&#21040;&#26368;</span>
    <span style="color: #5f8700;">try_files</span> /<span style="color: #0087ff;">$arg_file</span> /404.html;
}

<span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/404.html</span> {
    <span style="color: #5f8700;">return</span> 404 <span style="color: #00afaf;">"$image_file.$image_type Not Found"</span>;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">location</span> <span style="color: #0087ff;">/images/</span> {
    <span style="color: #5f8700;">rewrite</span> ^/images/(.*)$ http://1.2.3.4/images/<span style="color: #00afaf;">$1</span>/; <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27983;&#35272;&#22120;&#37325;&#23450;&#21521;&#33267; http://1.2.3.4/images/$1</span>
}
</pre>
</div>
</div>
</div>
