midwares/nginx.html


<div id="outline-container-org2050f1c" class="outline-3">
<h3 id="org2050f1c"><span class="section-number-3">2.9</span> Location</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-sh">location    &lt;uri&gt; { ... }  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#23545;&#24403;&#21069;&#36335;&#24452;&#21450;&#23376;&#36335;&#24452;&#19979;&#30340;&#25152;&#26377;&#36164;&#28304;&#37117;&#29983;&#25928;</span>
location =  &lt;uri&gt; { ... }  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21482;&#23545;&#24403;&#21069;&#36335;&#24452;&#29983;&#25928;&#65288;&#31934;&#30830;&#21305;&#37197;&#65292;&#19981;&#21253;&#25324;&#23376;&#36335;&#24452;&#65289;</span>
location ~  &lt;uri&gt; { ... }  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27491;&#21017;&#21305;&#37197;&#65288;&#21306;&#20998;&#22823;&#23567;&#20889;&#65289;</span>
location ~* &lt;uri&gt; { ... }  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27491;&#21017;&#21305;&#37197;&#65288;&#19981;&#21306;&#20998;&#22823;&#23567;&#20889;&#65289;</span>
location ^~ &lt;uri&gt; { ... }  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#38477;&#20302;&#27491;&#21017;&#21305;&#37197;&#30340;&#20248;&#20808;&#32423;</span>
</pre>
</div>
</div>

<div id="outline-container-orge7f0a36" class="outline-4">
<h4 id="orge7f0a36"><span class="section-number-4">2.9.1</span> 优先级</h4>
<div class="outline-text-4" id="text-2-9-1">
<pre class="example">
1. Directives with the "=" prefix that match the query exactly. If found, searching stops.
2. All remaining directives with literal strings. If this match used the "^~" prefix, searching stops.
3. Regular expressions, in the order they are defined in the configuration file.
4. If #3 yielded a match, that result is used. Otherwise, the match from #2 is used.
</pre>
</div>
</div>


<div id="outline-container-org87471a3" class="outline-4">
<h4 id="org87471a3"><span class="section-number-4">2.9.2</span> 转发规则</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
location 和 target 尽量都以 / 结尾，否则可能会遇到循环重定向问题，遇到问题请抓包分析即可知来龙去脉。
</p>

<div class="org-src-container">
<pre class="src src-sh">location /hello {
    root /home/test;   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/hello</span>
                       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#33509;&#19981;&#23384;&#22312;&#30446;&#24405; /home/test/hello &#65292;&#21017;&#36820;&#22238; 404</span>
                       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#33509;&#23384;&#22312;&#30446;&#24405;   /home/test/hello &#65292;&#37325;&#23450;&#21521;&#33267; https://&lt;domain&gt;/hello/&#65292;&#40664;&#35748;&#35831;&#27714; /home/test/hello/index.html</span>
}

location /hello {
    root /home/test/;  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21516;&#19978;</span>
}

location /hello/ {
    root /home/test;   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/hello &#65292; &#26080;&#27861;&#21305;&#37197;&#65292;&#36820;&#22238; 404</span>
                       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; https://&lt;domain&gt;/hello/&#65292;&#40664;&#35748;&#35831;&#27714; /home/test/hello/index.html</span>
}

location /hello/ {
    root /home/test/;  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21516;&#19978;</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">location /world {
    proxy_pass http://127.0.0.1:9999;   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world &#65292;   &#36716;&#21457;&#20026; GET /world HTTP/1.0</span>
                                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world/hk &#65292;&#36716;&#21457;&#20026; GET /world/hk HTTP/1.0</span>
}

location /world {
    proxy_pass http://127.0.0.1:9999/;  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world &#65292;   &#36716;&#21457;&#20026; GET / HTTP/1.0</span>
                                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world/hk &#65292;&#36716;&#21457;&#20026; GET //hk HTTP/1.0</span>
                                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">/ + (/world/hk - /world) = / + /hk = //hk</span>
}

location /world/ {
    proxy_pass http://127.0.0.1:9999;   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world &#65292;   &#37325;&#23450;&#21521;&#20026; http://&lt;domain&gt;/world/ &#65292;&#36716;&#21457;&#20026; GET /world/ HTTP/1.0</span>
                                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world/hk &#65292;&#36716;&#21457;&#20026; GET /world/hk HTTP/1.0</span>
}

location /world/ {
    proxy_pass http://127.0.0.1:9999/;  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world &#65292;   &#37325;&#23450;&#21521;&#20026; http://&lt;domain&gt;/world/ &#65292;&#36716;&#21457;&#20026; GET / HTTP/1.0</span>
                                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35775;&#38382; http://&lt;domain&gt;/world/hk &#65292;&#36716;&#21457;&#20026; GET /hk HTTP/1.0</span>
                                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">/ + (/workd/hk - /world/) = / + hk = /hk</span>
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org954a7be" class="outline-3">
<h3 id="org954a7be"><span class="section-number-3">2.10</span> 访问控制</h3>
<div class="outline-text-3" id="text-2-10">
<p>
默认是 <code>allow all</code> ，如果要启用访问控制功能，则最后一行必须为 <code>deny all</code>
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">location</span> <span style="color: #0087ff;">&lt;uri&gt;</span> {
    <span style="color: #5f8700;">deny</span>  192.168.0.2;
    <span style="color: #5f8700;">allow</span> 192.168.1.0/24;
    <span style="color: #5f8700;">deny</span>  all;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org58e835a" class="outline-3">
<h3 id="org58e835a"><span class="section-number-3">2.11</span> 端口转发</h3>
<div class="outline-text-3" id="text-2-11">
<p>
<b>The ngx_stream_core_module module is available since version 1.9.0</b>
</p>

<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #5f8700;">stream</span> {
    <span style="color: #5f8700;">server</span> {
        <span style="color: #5f8700;">listen</span>     48080;
        <span style="color: #5f8700;">proxy_pass</span> 127.0.0.1:8080;
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgaa90fe0" class="outline-3">
<h3 id="orgaa90fe0"><span class="section-number-3">2.12</span> 添加模块</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install libpcre3 libpcre3-dev build-essential zlib1g-dev -y
<span style="color: #0087ff;">version</span>=<span style="color: #fa8072;">`nginx -v 2&gt;&amp;1 | grep -o '[0-9]*\.[0-9]*\.[0-9]*'`</span>
curl -O http://hg.nginx.org/nginx/archive/release-$<span style="color: #0087ff;">version</span>.tar.gz
tar xfvz release-$<span style="color: #0087ff;">version</span>.tar.gz
<span style="color: #5f8700;">cd</span> nginx-release-$<span style="color: #0087ff;">version</span>
./auto/configure --with-stream
make
sudo make install
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfaed7f1" class="outline-3">
<h3 id="orgfaed7f1"><span class="section-number-3">2.13</span> Nginx in Docker</h3>
<div class="outline-text-3" id="text-2-13">
</div>
<div id="outline-container-orge5e556f" class="outline-4">
<h4 id="orge5e556f"><span class="section-number-4">2.13.1</span> 获取 nginx.conf</h4>
<div class="outline-text-4" id="text-2-13-1">
<div class="org-src-container">
<pre class="src src-sh">docker run --rm --name tmp-nginx -d nginx
docker cp tmp-nginx:/etc/nginx/nginx.conf /host/path/nginx.conf
docker rm -f tmp-nginx
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc274810" class="outline-4">
<h4 id="orgc274810"><span class="section-number-4">2.13.2</span> 自定义 nginx.conf</h4>
<div class="outline-text-4" id="text-2-13-2">
<p>
<code>docker run --rm --name my-nginx -p 8080:80 -v /host/path/nginx.conf:/etc/nginx/nginx.conf:ro -d nginx</code>
</p>
</div>
</div>

<div id="outline-container-org3fe4ed2" class="outline-4">
<h4 id="org3fe4ed2"><span class="section-number-4">2.13.3</span> 自定义静态文件</h4>
<div class="outline-text-4" id="text-2-13-3">
<p>
<code>docker run --rm --name my-nginx -v /some/content:/usr/share/nginx/html:ro -d nginx</code>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>